---
kind: type
id: T:Autodesk.Revit.DB.ParameterSetIterator
source: html/389eba07-4d2d-a26f-0a61-aae5054a669a.htm
---
# Autodesk.Revit.DB.ParameterSetIterator

An iterator to a parameter set.

## Syntax (C#)
```csharp
public abstract class ParameterSetIterator : APIObject,
	IEnumerator
```